# FDA-DETR: Frequency and Density-Aware DETR (基于 ResNet-50)
# 针对 VisDrone 高密度小目标场景定制

# 参数配置
nc: 10 # VisDrone 数据集的类别数 (pedestrian, people, bicycle, car, van, truck, tricycle, awning-tricycle, bus, motor)
scales: # model compound scaling constants, i.e. 'model=resnet50.yaml' will call resnet50 backbone
  r50: [1.00, 1.00, 1024]

# ResNet-50 Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, ResNetLayer, [3, 64, 1, True, 1]]  # 0-P1/2
  - [-1, 1, ResNetLayer, [64, 64, 1, False, 3]] # 1-P1/2
  - [-1, 1, ResNetLayer, [256, 128, 2, False, 4]] # 2-P2/4 (高分辨率特征，蕴含大量小目标)
  - [-1, 1, ResNetLayer, [512, 256, 2, False, 6]] # 3-P3/8
  - [-1, 1, ResNetLayer, [1024, 512, 2, False, 3]] # 4-P4/16

# FDA-DETR Head (Wavelet-FPN + Hybrid Encoder + Decoder)
head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 5 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 6 引入局部自注意力机制处理深层语义
  - [-1, 1, Conv, [256, 1, 1]]   # 7 Y5, channel = 256

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 8
  - [3, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 9 input_proj.1
  - [[-2, -1], 1, Concat, [1]] # 10
  # 传统这里是普通的 RepC3 融合，我们保持融合机制
  - [-1, 3, RepC3, [256, 0.5]]  # 11

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 12
  - [2, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 13 input_proj.0 (P2层极小目标特征)
  - [[-2, -1], 1, Concat, [1]]  # 14
  - [-1, 3, RepC3, [256, 0.5]]    # 15 (输出最高分辨率特征 P2)

  # ====================================================================
  # 核心创新植入点：WaveletFPN_Downsample 替换传统的 Conv 下采样
  # 彻底规避传统步长为2的卷积对微小目标高频边缘信息的“抹杀”
  # ====================================================================
  - [-1, 1, WaveletFPN_Downsample, [256]] # 16 频域解耦下采样，零参数量，放大高频细节
  - [[-1, 11], 1, Concat, [1]]  # 17
  - [-1, 3, RepC3, [256, 0.5]]    # 18

  - [-1, 1, WaveletFPN_Downsample, [256]] # 19 再次频域解耦下采样
  - [[-1, 7], 1, Concat, [1]]   # 20
  - [-1, 3, RepC3, [256, 0.5]]    # 21

  # 输出到 RTDETRDecoder (此处后续将由我们的 DNHQ 和 Freq-Sinkhorn 接管)
  - [[15, 18, 21], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # 22