# FDA-DETR-L 满血版: 完美对齐官方 HGNetv2-L 架构
nc: 10
scales:
  l: [1.00, 1.00, 1024]

backbone:
  - [-1, 1, HGStem, [32, 48]] # 0-P2/4
  - [-1, 6, HGBlock, [48, 128, 3]] # 1-stage 1

  - [-1, 1, DWConv, [128, 3, 2, 1, False]] # 2-P3/8
  - [-1, 6, HGBlock, [96, 512, 3]] # 3-stage 2

  - [-1, 1, DWConv, [512, 3, 2, 1, False]] # 4-P4/16
  - [-1, 6, HGBlock, [192, 1024, 5, True, False]] # 5-cm, c2, k, light, shortcut
  - [-1, 6, HGBlock, [192, 1024, 5, True, True]]  # 6
  - [-1, 6, HGBlock, [192, 1024, 5, True, True]]  # 7-stage 3 (P4)

  - [-1, 1, DWConv, [1024, 3, 2, 1, False]] # 8-P5/32
  - [-1, 6, HGBlock, [384, 2048, 5, True, False]] # 9-stage 4 (P5)

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 10 input_proj.2
  - [-1, 1, AIFI, [1024, 8]]                      # 11
  - [-1, 1, Conv, [256, 1, 1]]                    # 12, Y5

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 13
  - [7, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 14 input_proj.1
  - [[-2, -1], 1, Concat, [1]]                    # 15
  - [-1, 3, RepC3, [256]]                         # 16
  - [-1, 1, Conv, [256, 1, 1]]                    # 17, Y4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 18
  - [3, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 19 input_proj.0
  - [[-2, -1], 1, Concat, [1]]                    # 20
  - [-1, 3, RepC3, [256]]                         # 21 (X3)

  # --- 魔改点: 零参数小波下采样 ---
  - [-1, 1, WaveletFPN_Downsample, [256]]         # 22
  - [[-1, 17], 1, Concat, [1]]                    # 23
  - [-1, 3, RepC3, [256]]                         # 24 (F4)

  - [-1, 1, WaveletFPN_Downsample, [256]]         # 25
  - [[-1, 12], 1, Concat, [1]]                    # 26
  - [-1, 3, RepC3, [256]]                         # 27 (F5)

  - [[21, 24, 27], 1, RTDETRDecoder, [nc]]        # 28